app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating = "G" OR rating = "R") ORDER BY release_date
---
  def index
    @all_ratings = Movie.all_ratings



    @selected_ratings = params[:ratings]
    if @selected_ratings == nil
      @selected_ratings = {}
      @all_ratings.each do |current_rating|

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "21"]]
UPDATE "movies" SET "rating" = 'PG-13', "updated_at" = '2016-04-10 21:56:47.185385' WHERE "movies"."id" = 21
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])